Revit 2027 API
BuiltInFailures.ConnectorFailures.AirTerminalCenterNotAligned Property
 The center of the Air Terminal doesn't align at (0,0,0): align the Air Terminal Center to the Origin Defining Reference Planes could help to solve the problem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AirTerminalCenterNotAligned { get; }
Public Shared ReadOnly Property AirTerminalCenterNotAligned As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AirTerminalCenterNotAligned {
	FailureDefinitionId^ get ();
}
static member AirTerminalCenterNotAligned : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace